#ifndef __bush__
#define __bush__

//------------------------------------------------------------------------------
// bush.h - содержит описание прямоугольника  и его интерфейса
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

# include "rnd.h"

// прямоугольник
struct bush {
  char name[10];
  char type[10];
};

// Ввод параметров прямоугольника из файла
void In(bush& b, ifstream& ifst);

// Случайный ввод параметров прямоугольника
void InRnd(bush& b);

// Вывод параметров прямоугольника в форматируемый поток
void Out(bush& b, ofstream& ofst);

// Вычисление периметра прямоугольника
double Quotient(bush& b);

#endif //__bush__
