#ifndef __tree__
#define __tree__

//------------------------------------------------------------------------------
// tree.h - содержит описание прямоугольника  и его интерфейса
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

# include "rnd.h"

// прямоугольник
struct tree {
  int age;
  char name[10];
};

// Ввод параметров прямоугольника из файла
void In(tree& t, ifstream& ifst);

// Случайный ввод параметров прямоугольника
void InRnd(tree& t);

// Вывод параметров прямоугольника в форматируемый поток
void Out(tree& t, ofstream& ofst);

// Вычисление периметра прямоугольника
double Quotient(tree& t);

#endif //__tree__
